{
  "backend/main.mo": "Implements user profile storage with authorization checks and handles public contact inquiry submission plus admin-only inquiry retrieval and sorting.",
  "feature_evidence.json": "Declares a feature evidence report describing slug-validation changes and the related frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files including layouts, components, hooks, and marketing sections.",
  "frontend/index.css": "Defines global Tailwind CSS layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component switching between marketing and admin views and validating the deployment slug at runtime.",
  "frontend/src/components/Admin/AdminInquiriesPage.tsx": "Admin dashboard for listing, viewing, and inspecting contact inquiries with a detail dialog and back-navigation control.",
  "frontend/src/components/Admin/AdminRouteGuard.tsx": "Protects admin routes by enforcing authentication and admin role before rendering child components.",
  "frontend/src/components/Auth/LoginButton.tsx": "Controls Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "Dialog prompting first‑time authenticated users to enter and save their name for profile setup.",
  "frontend/src/components/Contact/ContactForm.tsx": "A controlled contact form that submits inquiries via a custom hook and shows a success or error state.",
  "frontend/src/components/Layout/SiteFooter.tsx": "Renders the site footer with branding, current year, and a referral link to caffeine.ai.",
  "frontend/src/components/Layout/SiteLayout.tsx": "Wraps pages with a header, footer, and main content area, supporting marketing/admin view switching.",
  "frontend/src/components/MarketingSite/MarketingSite.tsx": "Composes all marketing sections and conditionally shows a profile setup dialog based on user identity.",
  "frontend/src/components/MarketingSite/sections/AboutSection.tsx": "Presents company background, mission, expertise, and approach using branding data.",
  "frontend/src/components/MarketingSite/sections/CapabilitiesSection.tsx": "Displays a grid of government-focused capabilities with icons and bullet lists.",
  "frontend/src/components/MarketingSite/sections/ContactSection.tsx": "Shows the contact form alongside company contact details and guidance on what information to include.",
  "frontend/src/components/MarketingSite/sections/HomeHeroSection.tsx": "Hero section highlighting secure infrastructure services with CTAs that scroll to page sections.",
  "frontend/src/components/MarketingSite/sections/ServicesSection.tsx": "Lists core service offerings for government IT infrastructure with icon-based cards.",
  "frontend/src/components/Navigation/SiteHeader.tsx": "Header component with navigation, mobile menu, branding, and admin toggle based on user role.",
  "frontend/src/config/branding.ts": "Centralized branding settings including company name, tagline, domain, contact info, and deployment slug.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminInquiries.ts": "React-query hooks for fetching all contact inquiries or a single inquiry through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and saving user profiles and roles using the backend actor via react-query.",
  "frontend/src/hooks/useSubmitContactInquiry.ts": "Mutation hook to submit a contact inquiry using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up react-query, Internet Identity provider, and global styles.",
  "frontend/src/utils/slug.ts": "Utilities for generating and validating domain-safe slugs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, known deployment issues, and feature definitions for a marketing website build."
}