{
  "backend/main.mo": "Motoko canister handling user profiles with access control and storing/submitting contact inquiries with admin‑only retrieval.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files, their roles, and UI/logic purposes.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, theming tokens, and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level app component switching between marketing site and admin views inside themed layout.",
  "frontend/src/components/Admin/AdminInquiriesPage.tsx": "Admin dashboard listing contact inquiries with loading states, detail dialog, and back‑to‑site button.",
  "frontend/src/components/Admin/AdminRouteGuard.tsx": "Route guard enforcing Internet Identity login and admin‑role checks before rendering admin content.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "A dialog prompting authenticated users without a profile to enter their name and submit it via a mutation.",
  "frontend/src/components/Contact/ContactForm.tsx": "A contact form collecting user details and message, submitting via a mutation and showing success or error states.",
  "frontend/src/components/Layout/SiteFooter.tsx": "A site footer displaying copyright info and a link to caffeine.ai with dynamic year and hostname tracking.",
  "frontend/src/components/Layout/SiteLayout.tsx": "A layout wrapper that renders the header, page content, and footer with view-switching support.",
  "frontend/src/components/MarketingSite/MarketingSite.tsx": "Assembles all marketing sections and shows a profile setup dialog for authenticated users lacking a profile.",
  "frontend/src/components/MarketingSite/sections/AboutSection.tsx": "Renders an about section describing the company’s mission, expertise, and approach with icon highlights.",
  "frontend/src/components/MarketingSite/sections/CapabilitiesSection.tsx": "Displays a grid of government-focused capabilities with icons and bullet lists of services.",
  "frontend/src/components/MarketingSite/sections/ContactSection.tsx": "Provides a contact area with a message form and contact details including email, phone, and location.",
  "frontend/src/components/MarketingSite/sections/HomeHeroSection.tsx": "A hero section with marketing text, calls to action, trust indicators, and a hero image with smooth scrolling actions.",
  "frontend/src/components/MarketingSite/sections/ServicesSection.tsx": "Renders a marketing services section displaying a grid of service cards with icons, titles, and descriptions.",
  "frontend/src/components/Navigation/SiteHeader.tsx": "Implements the site header with navigation, authentication status, admin toggle, and mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdminInquiries.ts": "Provides queries for fetching all contact inquiries or a specific inquiry via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication state, login, logout, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching and updating the caller's user profile and role using the actor.",
  "frontend/src/hooks/useSubmitContactInquiry.ts": "Provides a mutation hook to submit a new contact inquiry through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for a themed responsive UI.",
  "project_state.json": "Defines project metadata, feature lists, requirements, and image needs for the IT consulting website."
}