{
  "kind": "build_request",
  "title": "Make Falconrock Consulting branding more prominent on the Home page and replace the header logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Generate a new static Falconrock logo image asset and add it to the frontend static assets directory so it can be used in the header and Home page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Also make me a flaconrock logo and put it on the home page"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image is generated and available under frontend/public/assets/generated using the exact filename specified in imageRequirements.required.",
        "The generated logo has a transparent background (or otherwise works cleanly on the site header/backgrounds) and remains legible at small sizes (e.g., 40x40) and medium sizes (e.g., 96x96)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Remove the existing top-left header logo image and replace it with the newly generated Falconrock logo, keeping the header branding (company name/tagline) intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "remove the existing logo that in the top left."
        ]
      },
      "acceptanceCriteria": [
        "The header no longer renders /assets/generated/it-consulting-logo.dim_512x512.png in the top-left branding area (see frontend/src/components/Navigation/SiteHeader.tsx).",
        "The top-left branding area renders the new Falconrock logo asset instead, with appropriate alt text referencing the company name.",
        "No other site sections unexpectedly lose images (e.g., the hero image remains unchanged)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Make the company name “Falconrock Consulting” more prominent on the Home page by adjusting the hero content hierarchy to feature the company name strongly (and include the new logo in the Home hero area).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "I want my company name falcon rock consulting to be more prominent on the home page."
        ]
      },
      "acceptanceCriteria": [
        "The Home hero section (frontend/src/components/MarketingSite/sections/HomeHeroSection.tsx) clearly features “Falconrock Consulting” as a primary visual element (e.g., headline/brand lockup) on initial page load.",
        "The new Falconrock logo is visible on the Home hero section without breaking layout on mobile and desktop.",
        "User-facing text uses correct capitalization/spelling: “Falconrock Consulting” (even if the user typed variants)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable hook/entry files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Redesigning non-home sections (Services/Capabilities/About/Contact) beyond what is necessary to maintain consistent branding.",
    "Changing the hero background image (/assets/generated/hero-datacenter.dim_1600x900.png) unless required for logo/name legibility.",
    "Any changes to authentication, admin features, or contact inquiry backend/storage."
  ],
  "imageRequirements": {
    "required": [
      "Falconrock logo mark, modern minimalist, strong geometric shape, no text, transparent background (falconrock-logo.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}