{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix invalid generated deployment slug/domain label",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Centralize slug generation in the frontend to always produce a valid deployment-facing domain label (5–50 chars, lowercase letters/numbers/hyphens only) and avoid parentheses/plus/spaces/non-ASCII hyphens.",
      "acceptanceCriteria": [
        "A deployment no longer fails with the domain/slug validation error shown in the issue.",
        "The generated domain/slug value is between 5 and 50 characters.",
        "The generated domain/slug value contains only letters, numbers, and hyphens (no spaces, parentheses, plus signs, or special hyphen characters)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/slug.ts",
          "operation": "create",
          "description": "Add a small utility that converts arbitrary project names into a valid domain-label slug: normalize Unicode hyphen-like characters to ASCII '-', lowercase, replace invalid separators (spaces/parentheses/plus) with '-', strip any remaining invalid characters, collapse consecutive hyphens, trim leading/trailing hyphens, and enforce 5–50 character length (including deterministic truncation if needed)."
        },
        {
          "path": "frontend/src/config/branding.ts",
          "operation": "modify",
          "description": "Introduce a dedicated deployment-facing slug value derived via the new slug utility (e.g., `deploymentSlug`) without changing the public branding domain (falconrock.app). Ensure the derived value is the one used wherever a deployment slug/domain label is surfaced or computed within the frontend build/runtime."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a lightweight runtime validation (non-blocking) that checks the configured/generated deployment slug against the domain-label constraints and logs a clear error if invalid, so issues are caught during local builds before deployment."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Ensure the project name value used for deployment slug generation is slug-safe by providing a frontend-maintained patch workflow to update the stored project name to a compliant slug value.",
      "acceptanceCriteria": [
        "project_state.json no longer contains parentheses/plus signs/non-ASCII hyphen characters in the project name value used for domain/slug generation.",
        "The updated project name value is 5–50 characters and contains only letters, numbers, and hyphens.",
        "Deployment proceeds past the domain/slug validation step using the updated value."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/patch-project-state-projectName.ts",
          "operation": "create",
          "description": "Create a small Node/TS script that updates the repository's project_state.json `projectName` to a slug-safe value (e.g., `falconrock-consulting-virtualization-on-prem-ia`) that meets the 5–50 character and character-set constraints. The script should be idempotent and should explicitly replace parentheses/plus/non-ASCII hyphens with safe characters, then validate before writing."
        },
        {
          "path": "frontend/scripts/README.md",
          "operation": "create",
          "description": "Document how to run the project_state.json patch script locally/CI to ensure the stored project name used for deployment slug generation remains compliant, and note the exact constraints (5–50 chars; lowercase letters/numbers/hyphens only)."
        }
      ]
    }
  ]
}