{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prominent Falconrock Consulting branding on Home hero and updated header logo",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add a newly generated Falconrock logo mark as a static frontend asset for reuse in header and Home hero.",
      "acceptanceCriteria": [
        "A new logo image is generated and available under frontend/public/assets/generated using the exact filename specified in imageRequirements.required.",
        "The generated logo has a transparent background (or otherwise works cleanly on the site header/backgrounds) and remains legible at small sizes (e.g., 40x40) and medium sizes (e.g., 96x96)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/falconrock-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated Falconrock logo mark asset (transparent background) as a static file so it can be referenced by the header and Home hero."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Replace the existing header logo image with the new Falconrock logo while keeping the header name/tagline intact.",
      "acceptanceCriteria": [
        "The header no longer renders /assets/generated/it-consulting-logo.dim_512x512.png in the top-left branding area (see frontend/src/components/Navigation/SiteHeader.tsx).",
        "The top-left branding area renders the new Falconrock logo asset instead, with appropriate alt text referencing the company name.",
        "No other site sections unexpectedly lose images (e.g., the hero image remains unchanged)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the top-left branding image to use frontend/public/assets/generated/falconrock-logo.dim_512x512.png instead of the existing it-consulting logo, keeping the company name/tagline rendering unchanged and ensuring alt text references BRANDING.companyName."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Adjust the Home hero hierarchy to strongly feature “Falconrock Consulting” and include the new logo in the hero area.",
      "acceptanceCriteria": [
        "The Home hero section (frontend/src/components/MarketingSite/sections/HomeHeroSection.tsx) clearly features “Falconrock Consulting” as a primary visual element (e.g., headline/brand lockup) on initial page load.",
        "The new Falconrock logo is visible on the Home hero section without breaking layout on mobile and desktop.",
        "User-facing text uses correct capitalization/spelling: “Falconrock Consulting” (even if the user typed variants)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MarketingSite/sections/HomeHeroSection.tsx",
          "operation": "modify",
          "description": "Rework the hero content to introduce a prominent brand lockup that includes the logo (frontend/public/assets/generated/falconrock-logo.dim_512x512.png) and the company name “Falconrock Consulting” as the primary visual element (use BRANDING.companyName), while preserving the existing hero background image and maintaining responsive layout."
        }
      ]
    }
  ]
}